{"cards": {"XSS": " Use a website a user trusts to execute malicious code.", "Rainbow tables": " Giant hashtables of precalculated hashes, usualy MD5", "Mandatory Access Control": " The system speficies which subject can access specific data objects.", "Access Control Lists": " Who can access what.", "OWASP top 10": " Injection, weak authentication, XSS, IDOR, Security misconf, Sensetive data exposure, Top level access control, CSRF, Known vulnerabilities, Unvalidated redirects and forwards.", "Authentication": " Prove that you are the identity you say you are.", "Identification": " Tell that you are someone.", "Risk management framework": " Categorize, Select, Implement, Assess, Authorize, Monitor", "Multilevel security": " Different people can access different stuff.", "Security theater": " Security theater is the practice of investing in countermeasures intended to provide the feeling of improved security while doing little or nothing to actually achieve it", "Web application fingerprints": " Web server information", "OpenSAMM": " Compare your security practices against best practice.", "Needham-Schroeder": " Like Kerberos, but uses nounces instead of timestamps.", "Principle of least privilege": " Processes should only be able to access exactly what they need, nothing more.", "Attack vector": " Path or means by which a hacker (or cracker) can gain access to a computer or network server ", "Attack surface": " Every surface of an application which can be used for a potential attack.", "Threat modeling process": " Identify critical assets, Decompose the system, Identify possible points of attack, Identify threats, Categorise/prioritise the threats, Mitigate.", "Biba": " A security model that values integrity, no read down, no write up.", "Sandboxing": " Running stuff in a seperate container.", "Kerberos": " Network auth protocol, auth over non-secure network. Both client and server identifies eachother. Protect against eavesdropping and replay attack, not timing.", "Misuse case": " Describes the process of executing a malicious act against a system, while use case can be used to describe any action taken by the system.", "Framework": " Politcy, what you want to achive, Mechanism, how you will implement, Assurance, the amount of trust on one mech, Incentive, the motive for people to do job properly.", "Timing attack": " Take the time before a prompt that validates a string cancel, this way you can find out how long it takes for a password to fail.", "The Chineese wall": " A security model where read/write access to files is governed by membership of data in conflict-of-interest classes and datasets. This is the basic model used to provide both privacy and integrity for data.", "One-way function": " Passwords should be encrypted/hashed one way, they should not be reversible.", "Three pillars": " Risk management, Touchpoints, Knowledge", "Race conditions": " Two people trying to change something at the sametime, which will result in one getting the wrong value.", "Eavesdropping": " Offer free WiFi to harvest passwords and other data.", "High-water-mark": " Under high-water mark, any object less than the user's security level can be opened, but the object is relabeled to reflect the highest security level currently open. Hence the name.", "Phishing": " Try to trick someone in to a false website to get their information.", "Groups vs roles ACL": " A group is a list of principals, a role is one or more principals that a role may use.", "HTTP Methods": " GET, POST, PUT, DELETE, TRACE, HEAD, OPTIONS, CONNECT", "Low-water-mark": " Opposite of High-water-mark", "One-time pad": " Encryption technique that encrypts plaintext paired with a random secret key.", "Zero-day vulnerability": " A vulnerability that currently has no fix.", "CSRF": " Trick a user to click a link which executes stuff on a different site. A mail.", "Attack tree": " A tree which describes the current threats to a system.", "Application entry points": " Attack surface", "Discretionary Access Control": " Unix file model, access control is controlled by the owner of the object.", "Pretexting": " False motive, Pretending to be somebody you are not, to get something you probably shouldnt have, to use in a way that is probably wrong", "Bell LaPadula": " A security model that values confidentiality, no read up, no write down.", "The lattice model": " MAC, Subject is only allowed to access an object if he has greater or equal sec level than the object.", "BSIMM": " Compare your security practice against other companies", "Captcha": " Completely Automated Public Turing test to tell Computers and Humans Apart", "SQL injection": " Using poorly sanitized inputfields to inject SQL code to get more information than you should.", "Spiders, robots, crawlers": " Information gathering", "Caprass": " Code review, Architectural risk, Penetration test, Risk-based security tests, Abuse cases, security requirements, security operations", "7 touchpoints": " Code review, Architectural risk, Penetration test, Risk-based security tests, Abuse cases, security requirements, security operations", "Proof carrying code": " Code that carries a proof that it will not violate local security policy.", "DoS": " Make a service unavailable by overloading the servers or network.", "Two-factor authentication": " Use two different things to authenticate you, usualy something you have and something you know."}, "subject": "tdt4237"}